Wiki1998-dev/stm32-baremetal-environment-monitor/Inc/spi_driver.h
/*
 * spi_driver.h
 *
 *  Created on: Dec 29, 2025
 *      Author: wiki
 */

#ifndef INC_SPI_DRIVER_H_
#define INC_SPI_DRIVER_H_

#include "stm32c031xx.h"
#include <stddef.h>
/*
 * Configuration structure for SPIx peripheral
 */
typedef struct
{
	uint8_t SPI_DeviceMode;
	uint8_t SPI_BusConfig;
	uint8_t SPI_SclkSpeed;
	uint8_t SPI_DFF;         // kept name for compatibility, maps to DS in CR2
	uint8_t SPI_CPOL;
	uint8_t SPI_CPHA;
	uint8_t SPI_SSM;
} SPI_Config_t;

/*
 * Handle structure for SPIx peripheral
 */
typedef struct
{
	SPI_TypeDef 	*pSPIx;   /*!< Base address of SPIx(x:1) peripheral >*/
	SPI_Config_t 	SPIConfig;
	uint8_t 		*pTxBuffer; /* !< To store the app. Tx buffer address > */
	uint8_t 		*pRxBuffer;	/* !< To store the app. Rx buffer address > */
	uint32_t 		TxLen;		/* !< To store Tx len > */
	uint32_t 		RxLen;		/* !< To store Rx len > */
	uint8_t 		TxState;	/* !< To store Tx state > */
	uint8_t 		RxState;	/* !< To store Rx state > */
} SPI_Handle_t;

/*
 * SPI application states
 */
#define SPI_READY 					0
#define SPI_BUSY_IN_RX 				1
#define SPI_BUSY_IN_TX 				2

/*
 * Possible SPI Application events
 */
#define SPI_EVENT_TX_CMPLT   1
#define SPI_EVENT_RX_CMPLT   2
#define SPI_EVENT_OVR_ERR    3
#define SPI_EVENT_CRC_ERR    4

/*
 * SPI related status flags definitions
 * (Using Masks from header file)
 */
#define SPI_TXE_FLAG    (SPI_SR_TXE)
#define SPI_RXNE_FLAG   (SPI_SR_RXNE)
#define SPI_BUSY_FLAG   (SPI_SR_BSY)

/*
 * Clock Enable/Disable Macros
 */
#define SPI1_PCLK_EN()        (RCC->APBENR2 |= RCC_APBENR2_SPI1EN)
#define SPI1_PCLK_DI()        (RCC->APBENR2 &= ~RCC_APBENR2_SPI1EN)

/*
 * Reset Macro
 * CORRECTION: Must use APBRSTR2 (Reset Register), not APBENR (Enable Register)
 */
#define SPI_REG_RESET()       do{ (RCC->APBRSTR2 |= (1 << 12)); (RCC->APBRSTR2 &= ~(1 << 12)); }while(0)

/*
 * Generic Macros
 */
#define ENABLE 				1
#define DISABLE 			0
#define SET 				ENABLE
#define RESET 				DISABLE
#define GPIO_PIN_SET 		1
#define GPIO_PIN_RESET 		0
#define FLAG_RESET          0
#define FLAG_SET            1

/*
 * @SPI_DeviceMode
 */
#define SPI_DEVICE_MODE_MASTER    1
#define SPI_DEVICE_MODE_SLAVE     0

/*
 * @SPI_BusConfig
 */
#define SPI_BUS_CONFIG_FD                1
#define SPI_BUS_CONFIG_HD                2
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY    3

/*
 * @SPI_SclkSpeed
 */
#define SPI_SCLK_SPEED_DIV2	 	0
#define SPI_SCLK_SPEED_DIV4		1
#define SPI_SCLK_SPEED_DIV8		2
#define SPI_SCLK_SPEED_DIV16	3
#define SPI_SCLK_SPEED_DIV32	4
#define SPI_SCLK_SPEED_DIV64	5
#define SPI_SCLK_SPEED_DIV128	6
#define SPI_SCLK_SPEED_DIV256	7

/*
 * @SPI_DFF
 */
#define SPI_DFF_8BITS 	0
#define SPI_DFF_16BITS 	1

/*
 * @SPI_CPHA
 */
#define SPI_CPHA_LOW 	0
#define SPI_CPHA_HIGH	1

/*
 * @SPI_CPOL
 */
#define SPI_CPOL_LOW 	0
#define SPI_CPOL_HIGH	1

/*
 * @SPI_SSM
 */
#define SPI_SSM_HW 	0
#define SPI_SSM_SW	1

/******************************************************************************************
 *								APIs supported by this driver
 ******************************************************************************************/

/* Peripheral Clock setup */
void SPI_PeriClockControl(SPI_TypeDef *pSPIx, uint8_t EnorDi);

/* Init and De-init */
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_TypeDef *pSPIx);

/* Data Send and Receive */
void SPI_SendData(SPI_TypeDef *pSPIx, uint8_t *pTxBuffer, uint32_t Len);
void SPI_ReceiveData(SPI_TypeDef *pSPIx, uint8_t *pRxBuffer, uint32_t Len);

uint8_t SPI_SendDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pTxBuffer, uint32_t Len);
uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer, uint32_t Len);

/* IRQ Configuration and ISR handling */
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void SPI_IRQHandling(SPI_Handle_t *pHandle);

/* Other Peripheral Control APIs */
void SPI_PeripheralControl(SPI_TypeDef *pSPIx, uint8_t EnOrDi);
void SPI_SSIConfig(SPI_TypeDef *pSPIx, uint8_t EnOrDi);
void SPI_SSOEConfig(SPI_TypeDef *pSPIx, uint8_t EnOrDi);
uint8_t SPI_GetFlagStatus(SPI_TypeDef *pSPIx , uint32_t FlagName);
void SPI_ClearOVRFlag(SPI_TypeDef *pSPIx);
void SPI_CloseTransmisson(SPI_Handle_t *pSPIHandle);
void SPI_CloseReception(SPI_Handle_t *pSPIHandle);

/* Application callback */
void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle, uint8_t AppEv);

#endif /* INC_SPI_DRIVER_H_ */
